
** Reading table to make JSON file
#+BEGIN_SRC python :var table = radii
import numpy as np
import json

all_ions, all_charges, all_coords, all_spins, all_r_crystal, all_r_ionic, all_remarks = [], [], [], [], [], [], []

d = {}

for entry in table:
    ion, charge, coord, spin, r_crystal, r_ionic, remark = entry

    if ion !='':
        i = ion
        d[i] = {}
    all_ions.append(i)
 
    if charge !='':
        c =str(charge)
        d[i][c] = {}
    all_charges.append(c)
    d[i][c][coord] = {} 
    d[i][c][coord]['spin'] = spin
    d[i][c][coord]['r_crystal'] = r_crystal
    d[i][c][coord]['r_ionic'] = r_ionic
    d[i][c][coord]['remark'] = remark

print d['Li']['1']['IV']['r_ionic']

with open('shannon-radii.json','wb') as f:
    f.write(json.dumps(d))
#+end_src

#+RESULTS:
: 0.59

